import os
import random
import time

images = [("                =/\                  /\=\n"
           "                / \'._   (\_/)   _.'/ \ \n"
           "               / .''._'--(o.o)--'_.''. \ \n"
           "              /.' _/ |`'=/ \" \='`| \_ `.\ \n"
           "             /` .' `\;-,'\___/',-;/` '. '\ \n"
           "            /.-' jgs   `\(-V-)/`       `-.\ \n"
           "            `            \"   \"            ` \n"),
          ("                                                     __      _\n"
           "                                                    o'')}____//\n"
           "                                                     `_/      )\n"
           "                                                     (_(_/-(_/ \n"),
          ("                                                                            _   \n"
           "                                                                        .--' |\n"
           "                                                                       /___^ |     .--.\n"
           "                                                                           ) |    /    \ \n"
           "                                                                          /  |  /`      '. \n"
           "                                                                         |   '-'    /     \ \n"
           "                                                                         \         |      |\ \n"
           "                                                                          \    /   \      /\| \n"
           "                                                                           \  /'----`\   / \n"
           "                                                                           |||       \\ | \n"
           "                                                                           ((|        ((| \n"
           "                                                                           |||        ||| \n"
           "                                                                    jgs   //_(       //_(  \n"), (
              "                                                                                                      (()__(()\n"
              "                                                                                                     /       \  \n"
              "                                                                                                    ( /    \  \ \n"
              "                                                                                                     \ o o    / \n"
              "                                                                                                     (_()_)__/ \ \n"
              "                                                                                                    / _,==.____ \ \n"
              "                                                                                                   (   |--|      ) \n"
              "                                                                                                   /\_.|__|'-.__/\_\n"
              "                                                                                                  / (        /     \ \n"
              "                                                                                                  \  \      (      / \n"
              "                                                                                                   )  '._____)    /    \n"
              "                                                                                                (((____.--(((____/ mrf \n")]

places = ["пещера", "дом", "пустыня", "лес"]
hints = {0: "Страшное животное! Граф Дракула превращается в него! Где же он живёт?!",
         1: "Настояший друг человека! Скорее всего) Он у вас есть)", 2: "Горбатый! Много пьёт и плюётся!",
         3: "Большой косолапый!"}

print(
    f"Привет! Сегодня мы сыграем в игру зоопарк! По месту вы должны отгадать животного, но у вас есть возможность взять подсказку.")

time.sleep(3)
os.system("cls")

# random_index = random.choice(range(len(images)))
random_index = 3

print("Скажите где живёт?!\n")
print(images[random_index])

choice = int(input("Вы можете выбрать: 1 - Отгадать сразу; 2 - Взять подсказку. Но учтите подсказок всего 3. "))

hint_amount = 0

answer = ""

while answer != places[random_index]:
    if choice == 1:
        print(f"Варианты: {places}")
        answer = input("Ваш ответ: ")
        os.system("cls")
    else:
        if hint_amount != 3:
            print(hints[random_index])
            hint_amount += 1
            choice = int(
                input("Вы можете выбрать: 1 - Отгадать сразу; 2 - Взять подсказку. Но учтите подсказок всего 3. "))
        else:
            print("Подсказки кончились")
            choice = 1
print("Правильно!")
