import os
import random
import time

images = [("                =/\                  /\=\n"
           "                / \'._   (\_/)   _.'/ \ \n"
           "               / .''._'--(o.o)--'_.''. \ \n"
           "              /.' _/ |`'=/ \" \='`| \_ `.\ \n"
           "             /` .' `\;-,'\___/',-;/` '. '\ \n"
           "            /.-' jgs   `\(-V-)/`       `-.\ \n"
           "            `            \"   \"            `"), ("                                                     __      _\n"
                                                              "                                                    o'')}____//\n"
                                                              "                                                     `_/      )\n"
                                                              "                                                     (_(_/-(_/"), ("                                                                            _   \n"
                                                                    "                                                                        .--' |\n"
                                                                    "                                                                       /___^ |     .--.\n"
                                                                    "                                                                           ) |    /    \ \n"
                                                                    "                                                                          /  |  /`      '. \n"
                                                                    "                                                                         |   '-'    /     \ \n"
                                                                    "                                                                         \         |      |\ \n"
                                                                    "                                                                          \    /   \      /\| \n"
                                                                    "                                                                           \  /'----`\   / \n"
                                                                    "                                                                           |||       \\ | \n"
                                                                    "                                                                           ((|        ((| \n"
                                                                    "                                                                           |||        ||| \n"
                                                                    "                                                                    jgs   //_(       //_( "), ("                                                                                                      (()__(()\n"
                                                                                                "                                                                                                     /       \  \n"
                                                                                                "                                                                                                    ( /    \  \ \n"
                                                                                                "                                                                                                     \ o o    / \n"
                                                                                                "                                                                                                     (_()_)__/ \ \n"
                                                                                                "                                                                                                    / _,==.____ \ \n"
                                                                                                "                                                                                                   (   |--|      ) \n"
                                                                                                "                                                                                                   /\_.|__|'-.__/\_\n"
                                                                                                "                                                                                                  / (        /     \ \n"
                                                                                                "                                                                                                  \  \      (      / \n"
                                                                                                "                                                                                                   )  '._____)    /    \n"
                                                                                                "                                                                                                (((____.--(((____/ mrf")]

places = ["пещера", "дом", "лес", "пустыня"]
right_answers = {places[0]: images[3], places[1]: images[1], places[2]: images[0], places[3]: places[2]}
hints = {0: "Страшное животное! Граф Дракула превращается в него! Где же он живёт?!", 1: "Настояший друг человека! Скорее всего) Он у вас есть)"}

print(f"Привет! Сегодня мы сыграем в игру зоопарк! По месту вы должны отгадать животного, но у вас есть возможность взять подсказку.")

time.sleep(1.5)
os.system("cls")

random_index = random.choice([i for i in range(len(images))])

print("Скажите где живёт?!")
print(images[random_index])

choice = int(input("Вы можете выбрать: 1 - Отгадать сразу; 2 - Взять подсказку. Но учтите подсказок всего 3. "))

if choice == 1:
    print(f"Варианты: {places}")
    answer = input("Ваш ответ: ")
    os.system("cls")
    while answer != places[random_index]:
        print("Неправильно!")
        choice = int(input("Вы можете выбрать: 1 - Отгадать сразу; 2 - Взять подсказку. Но учтите подсказок всего 3. "))
        if choice == 1:
            print(f"Варианты: {places}")
            answer = input("Ваш ответ: ")
        else:
            print()
    print("Правильно!")
